tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationWeb.cpp
void IrrigationWeb::flowCalibration() {
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_flow_calibration")) return;
        bool success = false;
        const WateringStatus status = g_app->wateringStatus();
        if (actionIs("start")) {
            uint32_t zoneId = 0;
            success = uintParam("zone_id", 1, BoardPins::kZoneCount, zoneId) &&
                      g_app->startFlowCalibration(static_cast<uint8_t>(zoneId), 10) ==
                          WateringStartResult::Started;
        } else if (actionIs("stop")) {
            success = status.active && status.purpose == WateringPurpose::FlowCalibration &&
                      g_app->stopWatering();
        } else if (actionIs("measurement")) {
            uint32_t measuredMl = 0;
            success = uintParam("measured_ml",
                                FlowCalibrationService::kMinimumMeasuredWaterMl,
                                FlowCalibrationService::kMaximumMeasuredWaterMl,
                                measuredMl) &&
                      g_app->submitFlowCalibrationMeasurement(measuredMl);
        } else if (actionIs("apply")) {
            success = g_app->applyFlowCalibrationResult();
        } else if (actionIs("clear")) {
            g_app->resetFlowCalibration();
            success = !g_app->wateringStatus().active;
        }
        redirectResult("/irrigation/zones/flow-calibration", success);
        return;
    }
    if (!beginPage("流量计校准", "通过不同接水量消除启动阶段影响，计算稳态脉冲/L")) return;
    Esp32BaseWeb::sendChunk(
        "<style>"
        ".cal-current{display:grid;grid-template-columns:minmax(0,1fr) auto;gap:16px;align-items:center;padding:16px;border:1px solid #cfe1e5;border-radius:10px;background:linear-gradient(135deg,#f2f9fa,#fff)}"
        ".cal-current-label{margin:0 0 5px;color:var(--eb-muted);font-size:13px}"
        ".cal-current-value{display:flex;align-items:baseline;gap:7px;color:var(--eb-primary);line-height:1}"
        ".cal-current-number{font-size:32px;font-weight:500;letter-spacing:-.02em}"
        ".cal-current-unit{font-size:14px;color:var(--eb-muted)}"
        ".cal-current-note{max-width:360px;color:var(--eb-muted);font-size:13px;line-height:1.6}"
        ".cal-steps{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:10px;margin-bottom:16px}"
        ".cal-step{display:grid;grid-template-columns:28px minmax(0,1fr);gap:9px;align-items:start;padding:12px;border:1px solid var(--eb-line-soft);border-radius:9px;background:var(--eb-soft);font-size:13px;line-height:1.55}"
        ".cal-step-num{display:flex;align-items:center;justify-content:center;width:26px;height:26px;border-radius:50%;background:var(--eb-primary-soft);color:var(--eb-primary);font-weight:600}"
        ".cal-action{padding:14px;border:1px solid var(--eb-line-soft);border-radius:9px;background:#fff}"
        ".cal-action .fieldgrid{margin:0}.cal-action .field{margin:0}"
        ".cal-action label{font-weight:500}"
        ".cal-action .actions{margin-bottom:0}"
        ".cal-live .metric b{font-weight:500}"
        ".cal-samples th{font-weight:600}.cal-samples td{font-weight:400}"
        ".cal-empty{padding:20px;text-align:center;border:1px dashed #c9d6dc;border-radius:9px;background:var(--eb-soft)}"
        ".cal-empty-title{margin:0;color:#344054;font-size:15px;font-weight:500}"
        ".cal-empty-text{margin:5px 0 0;color:var(--eb-muted);font-size:13px}"
        ".cal-result{margin-top:14px;padding:15px;border:1px solid #bfe0d4;border-radius:10px;background:var(--eb-ok-soft)}"
        ".cal-result-label{margin:0 0 5px;color:var(--eb-ok);font-size:13px}"
        ".cal-result-value{font-size:28px;font-weight:500;color:var(--eb-ok);line-height:1.15}"
        ".cal-result-detail{margin:7px 0 0;color:#526071;font-size:13px}"
        "@media(max-width:760px){"
        ".cal-current,.cal-steps{grid-template-columns:1fr}"
        ".cal-current{padding:14px}.cal-current-number{font-size:28px}"
        "}"
        "</style>");
    const IrrigationConfig* config = g_app->configuration();
    if (!config) { endPage(); return; }
    const WateringStatus status = g_app->wateringStatus();
    const FlowCalibrationService& calibration = g_app->flowCalibration();
    const bool active = status.active && status.purpose == WateringPurpose::FlowCalibration;
    char coefficient[20]{};
    IrrigationConfigRules::formatPulsesPerLiter(
        config->flowMeter.pulsesPerLiterX100, coefficient, sizeof(coefficient));
    Esp32BaseWeb::beginPanel("当前流量系数");
    Esp32BaseWeb::sendChunk("<div class='cal-current'><div><p class='cal-current-label'>设备当前使用</p><div class='cal-current-value'><span class='cal-current-number'>");
    Esp32BaseWeb::writeHtmlEscaped(coefficient);
    Esp32BaseWeb::sendChunk("</span><span class='cal-current-unit'>pulse/L</span></div></div><div class='cal-current-note'>校准完成前不会修改这个参数。只有确认使用校准结果后，系统才保存新的流量系数。</div></div>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::beginPanel("开始校准");
    Esp32BaseWeb::sendChunk("<div class='cal-steps'><div class='cal-step'><span class='cal-step-num'>1</span><span>选择一条已启用水路，每次都从完全停止状态重新开始接水。</span></div><div class='cal-step'><span class='cal-step-num'>2</span><span>至少采集两次不同水量；建议相差 500 mL 以上，达到 1 L 更可靠。</span></div><div class='cal-step'><span class='cal-step-num'>3</span><span>查看拟合质量，确认采用后才保存；全部样本只保存在内存。</span></div></div><div class='cal-action'>");
    if (status.active && !active) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备正在执行其它任务", "请等待当前任务结束后再校准。");
    } else if (active) {
        Esp32BaseWeb::sendChunk("<div id='cal-live' class='cal-live' data-was-active='1'><div class='metrics'><div class='metric'><b id='cal-elapsed'>"); sendUnsigned(status.elapsedSec); Esp32BaseWeb::sendChunk(" s</b><span>已运行</span></div><div class='metric'><b id='cal-pulses'>"); sendUnsigned(status.pulseCount); Esp32BaseWeb::sendChunk("</b><span>累计脉冲</span></div></div><form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='stop'><div class='actions'><input class='danger' type='submit' value='停止本次采样'></div></form></div>");
    } else if (calibration.hasPendingMeasurement()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "请输入本次实测水量", "按量杯读数填写，至少 1000 mL。");
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit='return once(this)'><input type='hidden' name='action' value='measurement'><div class='fieldgrid'><p class='field med'><label>实测水量</label><input type='number' name='measured_ml' min='1000' max='1000000' step='1' required><small>单位：mL，例如 1.5 L 填写 1500；范围 1000～1000000 mL。</small></p></div><div class='actions'><input type='submit' value='保存样本'></div></form>");
    } else if (calibration.sampleCount() < FlowCalibrationService::kMaximumSamples) {
        bool hasEligibleZone = false;
        for (const ZoneConfig& zone : config->zones) {
            hasEligibleZone = hasEligibleZone ||
                              (zone.enabled &&
                               (calibration.zoneId() == 0 ||
                                calibration.zoneId() == zone.id));
        }
        if (hasEligibleZone) {
            Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认开始流量计校准？开始后所选水路会立即出水。')&&once(this)\"><input type='hidden' name='action' value='start'><div class='fieldgrid'><p class='field med'><label>校准水路</label><select name='zone_id'>");
            for (const ZoneConfig& zone : config->zones) if (zone.enabled && (calibration.zoneId() == 0 || calibration.zoneId() == zone.id)) { Esp32BaseWeb::sendChunk("<option value='"); sendUnsigned(zone.id); Esp32BaseWeb::sendChunk("'>"); Esp32BaseWeb::writeHtmlEscaped(zone.name.data()); Esp32BaseWeb::sendChunk("</option>"); }
            Esp32BaseWeb::sendChunk("</select><small>一次校准会话固定使用同一条水路，单次最长 10 分钟。</small></p></div><div class='actions'><input type='submit' value='开始新样本'></div></form>");
        } else {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                                     "没有可用于校准的水路",
                                     calibration.zoneId() == 0
                                         ? "请先启用至少一条水路。"
                                         : "本次会话使用的水路已停用；请清空会话或重新启用该水路。");
        }
    } else {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "已达到 5 个样本", "可以应用结果，或清空后重新校准。");
    }
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("校准样本");
    if (calibration.sampleCount() == 0) {
        Esp32BaseWeb::sendChunk("<div class='cal-empty'><p class='cal-empty-title'>尚无校准样本</p><p class='cal-empty-text'>完成第一次接水并填写实测水量后，样本会显示在这里。</p></div>");
    } else {
        Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part cal-samples'><thead><tr><th>样本</th><th>实测水量</th><th>完整脉冲数</th></tr></thead><tbody>");
        for (uint8_t index = 0; index < calibration.sampleCount(); ++index) {
            const FlowCalibrationService::Sample* sample = calibration.sample(index);
            Esp32BaseWeb::sendChunk("<tr><td>"); sendUnsigned(index + 1U); Esp32BaseWeb::sendChunk("</td><td>"); sendUnsigned(sample->measuredWaterMl); Esp32BaseWeb::sendChunk(" mL</td><td>"); sendUnsigned(sample->pulseCount); Esp32BaseWeb::sendChunk("</td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
        if (!calibration.resultReady()) {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "暂不能生成稳态系数", "请增加不同水量的有效样本。");
        } else {
            char result[20]{};
            IrrigationConfigRules::formatPulsesPerLiter(
                calibration.combinedPulsesPerLiterX100(), result, sizeof(result));
            char detail[96]{};
            std::snprintf(detail, sizeof(detail), "水量跨度 %lu mL · 最大拟合残差 %u.%02u%%",
                          static_cast<unsigned long>(calibration.volumeSpanMl()),
                          calibration.maximumResidualPercentX100() / 100U,
                          calibration.maximumResidualPercentX100() % 100U);
            Esp32BaseWeb::sendChunk("<div class='cal-result'><p class='cal-result-label'>拟合得到的稳态流量系数</p><div class='cal-result-value'>");
            Esp32BaseWeb::writeHtmlEscaped(result);
            Esp32BaseWeb::sendChunk(" <span class='cal-current-unit'>pulse/L</span></div><p class='cal-result-detail'>");
            Esp32BaseWeb::writeHtmlEscaped(detail);
            Esp32BaseWeb::sendChunk("</p></div>");
            const uint8_t flags = calibration.qualityFlags();
            if (calibration.volumeSpanMl() >= 1000U) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "水量跨度达到 1 L", "这组样本对量杯读数误差更不敏感。");
            if (flags & FlowCalibrationService::kQualityOnlyTwoSamples) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "当前只有两个样本", "结果可用，建议增加第三个样本检查一致性。");
            if (flags & FlowCalibrationService::kQualitySmallVolumeSpan) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "水量差小于 500 mL", "量杯误差容易被放大，建议增加差距更大的样本。");
            if (flags & FlowCalibrationService::kQualityNonMonotonic) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "样本趋势不完全一致", "建议检查接水读数或补充样本。");
            if (flags & FlowCalibrationService::kQualityResidualHigh) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "拟合残差较大", "建议重新采样后再应用。");
            if (config->flowMeter.pulsesPerLiterX100 == calibration.combinedPulsesPerLiterX100()) {
                Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "当前已使用此结果");
            } else {
                Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认使用这组稳态流量系数？')&&once(this)\"><input type='hidden' name='action' value='apply'><div class='actions'><input type='submit' value='使用校准结果'></div></form>");
            }
        }
        if (!active) Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/flow-calibration' onsubmit=\"return confirm('确认清空本次内存样本？')&&once(this)\"><input type='hidden' name='action' value='clear'><div class='actions'><input class='danger' type='submit' value='清空本次校准'></div></form>");
    }
    Esp32BaseWeb::endPanel();
    if (active) Esp32BaseWeb::sendChunk("<script>(function(){function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(!s.active||s.purpose!==1){location.reload();return;}var e=document.getElementById('cal-elapsed'),p=document.getElementById('cal-pulses');if(e)e.textContent=s.elapsedSec+' s';if(p)p.textContent=s.pulseCount;setTimeout(poll,1000)}).catch(function(){setTimeout(poll,2000)})}setTimeout(poll,1000)})();</script>");
    endPage();
}

void IrrigationWeb::zoneLearning() {
    uint32_t zoneId = 0;
    char zoneText[12]{};
    if (getParam("zone", zoneText, sizeof(zoneText))) parseUint(zoneText, 1, BoardPins::kZoneCount, zoneId);
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!Esp32BaseWeb::checkPostAllowed("irrigation_zone_learning")) return;
        if (!uintParam("zone_id", 1, BoardPins::kZoneCount, zoneId)) {
            Esp32BaseWeb::sendText(400, "invalid_zone"); return;
        }
        const WateringStatus status = g_app->wateringStatus();
        bool success = false;
        if (actionIs("start")) success = g_app->startZoneFlowLearning(static_cast<uint8_t>(zoneId)) == WateringStartResult::Started;
        else if (actionIs("stop")) success = status.active && status.purpose == WateringPurpose::ZoneFlowLearning && status.activeZoneId == zoneId && g_app->stopWatering();
        else if (actionIs("save")) { uint32_t revision = 0; success = uintParam("revision", 1, UINT32_MAX, revision) && g_app->pendingLearnedZoneId() == zoneId && g_app->saveLearnedZoneFlow(revision); }
        else if (actionIs("discard")) { success = g_app->pendingLearnedZoneId() == zoneId; if (success) g_app->discardLearnedZoneFlow(); }
        char location[96]{};
        std::snprintf(location, sizeof(location), "/irrigation/zones/learning?zone=%lu&result=%s", static_cast<unsigned long>(zoneId), success ? "ok" : "error");
        Esp32BaseWeb::redirectSeeOther(location);
        return;
    }
    if (!beginPage("基准流量学习", "等待流量稳定后生成该水路的基准流量")) return;
    const IrrigationConfig* config = g_app->configuration();
    if (!config || zoneId == 0) { Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "水路参数无效"); endPage(); return; }
    const ZoneConfig& zone = config->zones[zoneId - 1U];
    const WateringStatus status = g_app->wateringStatus();
    const bool active = status.active && status.purpose == WateringPurpose::ZoneFlowLearning && status.activeZoneId == zoneId;
    char learned[20]{};
    IrrigationConfigRules::formatLitersPerMinute(zone.learnedFlowMlPerMinute, learned, sizeof(learned));
    char learnedWithUnit[32]{};
    std::snprintf(learnedWithUnit, sizeof(learnedWithUnit), "%s L/min", learned);
    Esp32BaseWeb::beginPanel("学习水路");
    Esp32BaseWeb::sendInfoRowCompact("水路名称", "", zone.name.data());
    Esp32BaseWeb::sendInfoRowCompact("当前基准流量", zone.learnedFlowMlPerMinute == 0 ? "尚未设置" : "", zone.learnedFlowMlPerMinute == 0 ? "未设置" : learnedWithUnit);
    Esp32BaseWeb::sendInfoRowCompact("安全上限", "达到上限仍不稳定时自动停止", "10 分钟");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::beginPanel("学习状态");
    if (!zone.enabled) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "这条水路尚未启用", "请先返回水路设置启用。");
    } else if (status.active && !active) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "设备正在执行其它任务");
    } else if (active) {
        Esp32BaseWeb::sendChunk("<div class='metrics'><div class='metric'><b id='learn-elapsed'>"); sendUnsigned(status.elapsedSec); Esp32BaseWeb::sendChunk(" s</b><span>已运行</span></div><div class='metric'><b id='learn-current'>"); sendUnsigned(status.currentFlowMlPerMinute); Esp32BaseWeb::sendChunk(" mL/min</b><span>最近 5 秒流量</span></div><div class='metric'><b id='learn-average'>"); sendUnsigned(status.learningAverageMlPerMinute); Esp32BaseWeb::sendChunk(" mL/min</b><span>窗口平均值</span></div><div class='metric'><b id='learn-range'>"); sendUnsigned(status.learningMinimumMlPerMinute); Esp32BaseWeb::sendChunk("–"); sendUnsigned(status.learningMaximumMlPerMinute); Esp32BaseWeb::sendChunk("</b><span>窗口范围</span></div></div><p class='muted'>有效窗口：<b id='learn-count'>"); sendUnsigned(status.learningSampleCount); Esp32BaseWeb::sendChunk("/5</b></p><form method='post' action='/irrigation/zones/learning' onsubmit='return once(this)'><input type='hidden' name='action' value='stop'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><div class='actions'><input class='danger' type='submit' value='停止学习'></div></form>");
    } else if (g_app->pendingLearnedZoneId() == zoneId) {
        char suggestion[20]{};
        const bool validSuggestion = IrrigationConfigRules::formatLitersPerMinute(
            g_app->pendingLearnedFlowMlPerMinute(), suggestion, sizeof(suggestion));
        if (validSuggestion) {
            char suggestionWithUnit[32]{};
            std::snprintf(suggestionWithUnit, sizeof(suggestionWithUnit), "%s L/min", suggestion);
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "学习完成", suggestionWithUnit);
            Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/learning' onsubmit='return once(this)'><input type='hidden' name='action' value='save'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><input type='hidden' name='revision' value='"); sendUnsigned(config->revision); Esp32BaseWeb::sendChunk("'><div class='actions'><input type='submit' value='保存为基准流量'></div></form>");
        } else {
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER,
                                     "学习结果超出有效范围",
                                     "基准流量必须在 0～100.000 L/min，请检查流量系数后重新学习。");
        }
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/zones/learning' onsubmit='return once(this)'><input type='hidden' name='action' value='discard'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><div class='actions'><input class='danger' type='submit' value='放弃结果'></div></form>");
    } else if (g_app->pendingLearnedZoneId() != 0) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN,
                                 "另一条水路有待确认的学习结果",
                                 "请先返回对应水路保存或放弃该结果。");
    } else {
        if (status.purpose == WateringPurpose::ZoneFlowLearning && status.lastZoneId == zoneId && status.lastStopReason == WateringStopReason::LearningTimeout) Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "学习超时", "10 分钟内没有取得稳定流量，请检查供水和管路。");
        Esp32BaseWeb::sendChunk("<p class='muted'>系统每 5 秒计算一次流量，最近 5 个窗口波动不超过平均值的 10%时自动完成。</p><form method='post' action='/irrigation/zones/learning' onsubmit=\"return confirm('确认开始学习基准流量？开始后这条水路会立即出水。')&&once(this)\"><input type='hidden' name='action' value='start'><input type='hidden' name='zone_id' value='"); sendUnsigned(zoneId); Esp32BaseWeb::sendChunk("'><div class='actions'><input type='submit' value='开始学习'></div></form>");
    }
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendChunk("<p><a class='btnlink secondary' href='/irrigation/zones'>返回水路设置</a></p>");
    if (active) Esp32BaseWeb::sendChunk("<script>(function(){function set(id,v){var e=document.getElementById(id);if(e)e.textContent=v}function poll(){fetch('/irrigation/api/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){return r.json()}).then(function(s){if(!s.active||s.purpose!==2){location.reload();return;}set('learn-elapsed',s.elapsedSec+' s');set('learn-current',s.currentFlowMlPerMinute+' mL/min');set('learn-average',s.learningAverageMlPerMinute+' mL/min');set('learn-range',s.learningMinimumMlPerMinute+'–'+s.learningMaximumMlPerMinute);set('learn-count',s.learningSampleCount+'/5');setTimeout(poll,1000)}).catch(function(){setTimeout(poll,2000)})}setTimeout(poll,1000)})();</script>");
    endPage();
}

